openfoam/test_workflow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          625;
        startFace       163783;
    }
    outlet
    {
        type            patch;
        nFaces          625;
        startFace       164408;
    }
    atmosphere
    {
        type            patch;
        nFaces          4000;
        startFace       165033;
    }
    rocket
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3915;
        startFace       169033;
    }
)

// ************************************************************************* //
